Create a series named heights_A with values 176.2, 158.4, 167.6, 156.2, and 161.4. These values represent the heights of 5 students of class A.

Label each student as s1, s2, s3, s4, and s5.

Print the second element of series heights_A.

Note: Use index number or the value corresponding to the second element inside square brackets.

In [8]:
import pandas as pd
heights_A = pd.Series([176.2, 158.4, 167.6, 156.2, 161.4], index=['s1', 's2', 's3', 's4', 's5'])
print(heights_A[2])

167.6

In [9]:
print(heights_A[1:4])

s2    158.4
s3    167.6
s4    156.2
dtype: float64

In [ ]:
Create another series named weights_A with values 85.1, 90.2, 76.8, 80.4, and 78.9. These values represent the weights of 5 students of class A.

Label each student as s1, s2, s3, s4, and s5.

Create a dataframe named df_A, which contains the height and weight of five students namely s1, s2, s3, s4 and s5.

Label the columns as Student_height and Student_weight, respectively.

Select the column df_A referring to student heights, and store it in the variable height. Note: Specify the required column name inside square brackets.

Print the type of object of the variable height.

Instructions

In [22]:
weights_A = pd.Series([85.1, 90.2, 76.8, 80.4, 78.9], index=['s1', 's2', 's3', 's4', 's5'])

In [42]:
df_A = pd.DataFrame()
df_A['Student_height'] = heights_A
df_A['Student_weight'] = weights_A
height=df_A['Student_height']
type(height)

pandas.core.series.Series

In [43]:
df_A

    Student_height  Student_weight
s1           176.2            85.1
s2           158.4            90.2
s3           167.6            76.8
s4           156.2            80.4
s5           161.4            78.9

In [ ]:
Select the rows corresponding to students s1, s2 of df_A, and capture them in 
another dataframe df_s1s2. Note: Use either .loc or .iloc methods.

Print the dataframe df_s1s2.

In [46]:
df_s1s2 = df_A.loc[['s1','s2']]
print(df_s1s2)

    Student_height  Student_weight
s1           176.2            85.1
s2           158.4            90.2

In [45]:
Select the rows corresponding to 
students s1, s2 and s5 of df_A in the order s2, s5, s1, and capture them in another dataframe df_s2s5s1.

    Student_height  Student_weight
s1           176.2            85.1
s2           158.4            90.2

In [47]:
df_s2s5s1 = df_A.loc[['s2','s5','s1']]
print(df_s2s5s1)

    Student_height  Student_weight
s1           176.2            85.1
s2           158.4            90.2
s5           161.4            78.9

In [ ]:
Select those rows of df_A whose index values end with 1 or 4, 
and capture them in another dataframe df_s1s4. Note: Pass a boolean
    function which checks if an index string ends with 1 or 4 to .loc or .iloc methods.

Print the dataframe df_s1s4.

    Student_height  Student_weight
s1           176.2            85.1
s4           156.2            80.4

In [78]:
def f(i):
    if str(i).endswith('1') or str(i).endswith('4'):
        return True
    else:
        return False
df_s1s4=df_A[[f(i) for i in df_A.index]]
print(df_s1s4)

    Student_height  Student_weight
s1           176.2            85.1
s4           156.2            80.4

In [76]:
df_A[df_A.index(f)]

TypeError: 'Index' object is not callable

In [79]:
df = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3'])

In [80]:
df.loc['r4'] = [67, 78]

In [81]:
df

     A   B
r1  34  12
r2  78  67
r3  54  43
r4  67  78

In [82]:
import pandas as pd

df = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3'])

In [83]:
df[:2]

     A   B
r1  34  12
r2  78  67

In [84]:
df.iloc[:2]

     A   B
r1  34  12
r2  78  67

In [92]:
import pandas as pd
import numpy as np
temp = pd.Series(28 + 10*np.random.randint(10))
temp

0    28
dtype: int64

In [91]:
np.random.randint(10)

1

In [93]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'temp':pd.Series(28 + 10*np.random.randn(10)), 
                'rain':pd.Series(100 + 50*np.random.randn(10)),
             'location':list('AAAAABBBBB')})
df

        temp        rain location
0  33.858366    7.819072        A
1  24.403771   84.911371        A
2  21.589113  114.203495        A
3  15.112874   71.743845        A
4  33.435271  152.150373        A
5  25.621713  110.101852        B
6  23.744333   64.511340        B
7  34.711885   56.718885        B
8  43.541328   56.965294        B
9  33.144921  171.526721        B

In [ ]:
df.describe()